#+TITLE: C Fundamentals practice
#+AUTHOR: [yourName] (pledged)
#+PROPERTY: header-args:C :main yes :includes <stdio.h> :results output :exports both :comments both
* TODO Comment program

   Write short comments in the program [[pgm:comment2]] to explain what each
   part of the program does (guess if you don't know for sure) -
   comment at least whenever you see ~WRITE COMMENT HERE~.

   #+name: pgm:comment2
   #+begin_src C
     #include <stdio.h> // WRITE COMMENT HERE

     int main (void) // WRITE COMMENT HERE
     {
       /* 
	 WRITE COMMENT HERE */
       int i = 1;

       // WRITE COMMENT HERE
       printf("%d\n", i);

       return 0;
     }
   #+end_src

   #+RESULTS: pgm:comment2
   : 1

   The program contains so-called /inline/ comments ~//~ and /multi-line/
   comments: ~/* ... */.~

* TODO Fix the program

  The program [[pgm:assign_err]] declares and initializes the variable ~i~ with the
  value ~0~. After assigning ~1~ to ~i~, it should print out ~1~ but it prints
  ~0~ instead.

  Fix the error and then run the block with ~C-c C-c~ to check.

  #+name: pgm:assign_err
  #+begin_src C
    int i = 0;
    i == 1;
    printf("%d\n", i);
  #+end_src

  #+RESULTS: assign
  : 0

* TODO Reading input

  1) Copy the code block [[pgm:iscan]] below into a code block [[pgm:fscan]]

  2) Modify [[pgm:fscan]] so that it reads a floating-point variable ~x~
     instead of an integer variable ~i~.

  2) The /format specifier/ for ~float~ numbers is ~%f~.

  3) Create an input file named ~finput~ in ~$PWD~ and put the number
     ~3.141593~ into it.

  4) Run [[pgm:fscan]]

  #+name: pgm:iscan
  #+begin_src C :cmdline < ./data/input
    int i;
    puts("Enter an integer!");
    scanf("%d", &i);
    printf("You entered %d\n", i);
  #+end_src

  #+RESULTS: pgm:iscan
  : Enter an integer!
  : You entered 5

